client/load-testing.yml
config:
  target: 'http://localhost:5173'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 100
      name: "Ramp-up"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    
    # Peak load phase (10,000 concurrent users simulation)
    - duration: 180
      arrivalRate: 100
      rampTo: 1000
      name: "Peak load"
    
    # Cooldown phase
    - duration: 60
      arrivalRate: 100
      rampTo: 10
      name: "Cooldown"

  defaults:
    headers:
      User-Agent: "Artillery Load Test"
      Accept: "application/json, text/plain, */*"
      Accept-Language: "en-US,en;q=0.9"
      Accept-Encoding: "gzip, deflate, br"
      Connection: "keep-alive"

  # Performance thresholds
  ensure:
    maxErrorRate: 5
    p95: 2000  # 95% of requests should complete within 2 seconds
    p99: 5000  # 99% of requests should complete within 5 seconds

scenarios:
  # Home page browsing
  - name: "Home Page Load"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: html
      - think: 2

  # Product browsing
  - name: "Product Browsing"
    weight: 25
    flow:
      - get:
          url: "/products"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/pets"
          expect:
            - statusCode: 200
      - think: 2

  # Search functionality
  - name: "Search Operations"
    weight: 20
    flow:
      - get:
          url: "/search?q=dog"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/search?q=cat"
          expect:
            - statusCode: 200
      - think: 1

  # User authentication
  - name: "Authentication"
    weight: 15
    flow:
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
          expect:
            - statusCode: [200, 401]  # Accept both success and failure
      - think: 2

  # Shopping cart operations
  - name: "Shopping Cart"
    weight: 10
    flow:
      - get:
          url: "/cart"
          expect:
            - statusCode: 200
      - think: 2
      - post:
          url: "/api/cart/add"
          json:
            productId: "123"
            quantity: 1
          expect:
            - statusCode: [200, 201]
      - think: 1